app/controllers/dashboards_controller.rb

SELECT `time_entries`.* FROM `time_entries`  ORDER BY `time_entries`.`signin_time` DESC
---
	def index
	  @time_entries = TimeEntry.all.order(signin_time: :desc)