app/controllers/sessions_controller.rb

	def create
	  @user = User.authenticate(params[:user_name])
    if @user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "shree"]]