app/controllers/users_controller.rb

  def create
     @user = User.new(user_params)
     if @user.valid?
       @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "shree"], ["created_at", "2016-10-30 12:04:34.621348"], ["updated_at", "2016-10-30 12:04:34.621348"]]